# print("Hello!\nMy переносить текст  в інший рядок
#
# print(f...  означає, що виводитемо {}
#
# #потрійні лапки дозволяють дозволяють писати з нового рядка
#
# age = int(input("How old are you? ")) #int означає, що вводимо число
# {1+age}
#
# #if означає "якщо"
# #Після : Python очікує блок коду з відступом
# #> більше, < менше, >= більше або дорівнює, <=	менше або дорівнює, ==	дорівнює, != не дорівнює
# #else — інакше
#
# ...ticket? ").lower() #перший варіант на маленьку букву
#
# while означає "поки"
# break - Негайно вийти з циклу.
#
# Якщо while означає:"Поки умова істинна..."
# то for означає: "Для кожного елемента..." або "Повтори певну кількість разів."
#
# print(len(fruits)) #len - кількість значень змінної
#
# fruits.append("watermelon") #додає один елемент
# #fruits.extend(["watermelon", "grape"]) додає декілька елементів
# fruits = fruits + ["watermelon", "grape"] додати список до списку
# fruits.remove("banana") видаляє елемент зі списку

# title() Робить першу букву великою
# "denys ivanov".capitalize() Denys ivanov
# "denys ivanov".title() Denys Ivanov
# name = input("Enter your name: ").strip().title() - strip() прибирає пробіли з початку і кінця.

# print("Hello") Друкує і переходить на новий рядок
# print("Hello", end="") Друкує без переходу
# print("Hello", end=" ") Друкує і ставить пробіл
# print() Просто переходить на новий рядок